---
kind: other
id: Properties.T:Autodesk.Revit.DB.RoutingConditions
source: html/ffa9d3ae-e520-ab42-ae1a-52d87427e398.htm
---
# RoutingConditions Properties

The error level that the routing preference manager should post errors if the routing conditions do not meet any routing preference rule, could be None, Warning, or Error